public class N2 {
    public static void main(String[] args){
        boolean _bit = true;// булевая переменная прлинициализировали значение "истина.
        byte _byte= 127; // байтовая переменная -128 до 127, проинициализировали значение 127
        short _short= 32767;// 16битовое целое число от -32768 до 32767, проинициализировали значением 32767
        int _int=1000; // 32 битовое знаковое число в диапазоне -2147483648   до 2147483647, проинициализорвали значением 1000
        long _long = 20L;// 64 битное знаковое число, проинициализировали 20.
        float _float= 1.5f;// 32 битное знаковое число с плавающей запятой олинарной точности, проинициализировали 1.5
        double _double=1.777;// 64 битное знаковое число с плавающей точкой двойной точностии, проинициализировали 1.777
        char _char= 256;// 16битовое число предназначино для хранения символов в кодировке unicode  проинициализировали 256
}
}